# *Задача*

```sh 
Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.

Примеры:

[“Hello”, “2”, “world”, “:-)”] → [“2”, “:-)”]

[“1234”, “1567”, “-2”, “computer science”] → [“-2”]

[“Russia”, “Denmark”, “Kazan”] → []
```

# *Решение*

* Использован метод static void Main

* Задан массив типа string[] из примера 1: [“Hello”, “2”, “world”, “:-)”]

* Заданы условия:

а) новый массив класса string[] размером с ранее заданный массив;

б) переменная для хранения размера нового массива j;

* Выведен заданный масив. Для сохранения форматирования задания использован вывод каждого элемента в отдельности

* Для переборки элементов массива использован цикл for

* Для выборки элементов, удвлетворяющих условию задачи, использовалось условие if с присвоением значений i переменной j нового массива

* Для сборки нового массива с корректировкой исходного установленного размера использовалась функция Array.Resize

* Для вывода полученного массива использовались циклы for.

*Если отбросить форматирование, то более простым решением было бы использование одного цикла foreach и одного вывода Console.Write, но в данном случае потребовался дополнительный вывод элементов маасива, в связи с чем были использованы 2 цикла for и 3 вывода Console.Write*
